<?php

//задание 1
//
//$i = 0;
//
//while($i < 100){
//    if ($i % 3 === 0){
//        echo $i . ' ';
//        $i++;
//    } else {
//        $i++;
//    }
//}

//задание 2

//$i = 0;
//
//do{
//    if ($i === 0) {
//        echo $i . ' - ноль' . "<br>";
//    }
//
//    $i++;
//
//    if ($i % 2 === 0){
//        echo $i . ' - четное число' . "<br>";
//    } else {
//        echo $i . ' - нечетное число' . "<br>";
//    }
//
//} while ($i <= 10);

//задание 3

//$cities = [
//    'Московская область' => ['Москва', 'Зеленоград', 'Мытищи'],
//    'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск']
//];
//
//foreach ($cities as $key => $city){
//    echo $key . ':' . "<br>";
//    echo implode(', ', $city) . "<br>";
//}

// задание 4

//$arr = [
//    'а' => 'a',
//    'б' => 'b',
//    'в' => 'v',
//    'г' => 'g',
//    'д' => 'd',
//    'e' => 'e',
//    'ё' => 'jo',
//    'ж' => 'zh',
//    'з' => 'z',
//    'и' => 'i',
//    'й' => 'j',
//    'к' => 'k',
//    'л' => 'l',
//    'м' => 'm',
//    'н' => 'n',
//    'о' => 'o',
//    'п' => 'p',
//    'р' => 'r',
//    'с' => 's',
//    'т' => 't',
//    'у' => 'u',
//    'ф' => 'f',
//    'х' => 'h',
//    'ц' => 'c',
//    'ш' => 'sh',
//    'щ' => 'sh',
//    'ъ' => '#',
//    'ы' => 'y',
//    'ь' => '\'',
//    'э' => 'je',
//    'ю' => 'ju',
//    'я' => 'ja'
//];
//
//$str = 'маша сидит за компуктером';
//$i = 0;
//
//$arrSymbol = preg_split('//u', $str,null, PREG_SPLIT_NO_EMPTY);

//function find($item, $arr) {
//    if(in_array($item, $arr)){
//        $arrSymbol[$item] =
//}
//};

//array_map(
//    function($item) => {
//        if(in_array($item, $arr)){
//
//        }
//}, $arr);

//задание 5

//$str = 'my cat is very stupid';
//$arr = explode(' ', $str);
//
//$newSrting = implode('_', $arr);
//
//echo $newSrting;

//задание 7

//for($i = 0; print $i, $i++ < 9;){}


